#+STARTUP: indent contents
#+OPTIONS: num:nil toc:nil
** Test Cases

Some simple grids to test printing and single round advancement.

#+NAME: single-round-combat
#+BEGIN_SRC lisp :results output :exports both
  (let ((game (parse-map (list "######"
                               "#.GE.#"
                               "#....#"
                               "######"))))
    (print-grid game)
    (execute-round game)
    (print-grid game))
#+END_SRC

Expected result: both start at 200 HP, both end at 197 HP.

#+RESULTS: single-round-combat
#+begin_example
Round #0
######
#.GE.# (E 200 3) (G 200 3)
#....#
######
Elf HP: 200
# Elves: 1
Goblin HP: 200
# Goblins: 1
Round #1
######
#.GE.# (E 197 3) (G 197 3)
#....#
######
Elf HP: 197
# Elves: 1
Goblin HP: 197
# Goblins: 1
#+end_example

#+NAME: full-round-combat
#+BEGIN_SRC lisp :results output :exports both
  (let ((game (parse-map (list "######"
                               "#.GE.#"
                               "#....#"
                               "######"))))
    (run-game game))
#+END_SRC

The goblin should survive, and he does. He wins because he hits
first.
#+RESULTS: full-round-combat
#+begin_example
Round #0
######
#.GE.# (E 200 3) (G 200 3)
#....#
######
Elf HP: 200
# Elves: 1
Goblin HP: 200
# Goblins: 1
Round #67
######
#.G..# (G 2 3)
#....#
######
Elf HP: 0
# Elves: 0
Goblin HP: 2
# Goblins: 1
#+end_example

#+NAME: two-on-one-combat
#+BEGIN_SRC lisp :results output :exports both
  (let ((game (parse-map (list "######"
                               "#.GE.#"
                               "#..G.#"
                               "######"))))
    (run-game game))
#+END_SRC

Expected: Elf dies after 200/6 rounds (rounded down, so round 33). Top
Goblin has HP reduced by 3 33 times to 101 HP. Bottom Goblin has full
health. This gives me confidence my round count is correct.
#+RESULTS: two-on-one-combat
#+begin_example
Round #0
######
#.GE.# (E 200 3) (G 200 3)
#..G.# (G 200 3)
######
Elf HP: 200
# Elves: 1
Goblin HP: 400
# Goblins: 2
Round #33
######
#.G..# (G 101 3)
#..G.# (G 200 3)
######
Elf HP: 0
# Elves: 0
Goblin HP: 301
# Goblins: 2
#+end_example

#+NAME: single-movement
#+BEGIN_SRC lisp :results output :exports both
  (let ((game (parse-map (list "######"
                               "#..G.#"
                               "#....#"
                               "#..E.#"
                               "######"))))
    (run-game game))
#+END_SRC

Expected: The Goblin moves one south, and is attacked on that same
round by the ELf. This gives the Elf the advantage of first attack and
he wins after 67 rounds.
#+RESULTS: single-movement
#+begin_example
Round #0
######
#..G.# (G 200 3)
#....#
#..E.# (E 200 3)
######
Elf HP: 200
# Elves: 1
Goblin HP: 200
# Goblins: 1
Round #67
######
#....#
#..G.# (G 2 3)
#....#
######
Elf HP: 0
# Elves: 0
Goblin HP: 2
# Goblins: 1
#+end_example

#+NAME: tc-18740
#+BEGIN_SRC lisp :results output :exports both
  (let ((game (parse-map (list "#########"
                               "#G......#"
                               "#.E.#...#"
                               "#..##..G#"
                               "#...##..#"
                               "#...#...#"
                               "#.G...G.#"
                               "#.....G.#"
                               "#########"))))
        (run-game game))
#+END_SRC

#+RESULTS: tc-18740
#+begin_example
Round #0
#########
#G......# (G 200 3)
#.E.#...# (E 200 3)
#..##..G# (G 200 3)
#...##..#
#...#...#
#.G...G.# (G 200 3) (G 200 3)
#.....G.# (G 200 3)
#########
Elf HP: 200
# Elves: 1
Goblin HP: 1000
# Goblins: 5
Round #20
#########
#.G.....# (G 137 3)
#G.G#...# (G 200 3) (G 200 3)
#.G##...# (G 200 3)
#...##..#
#.G.#...# (G 200 3)
#.......#
#.......#
#########
Elf HP: 0
# Elves: 0
Goblin HP: 937
# Goblins: 5
#+end_example

#+NAME: tc-28944
#+BEGIN_SRC lisp :results output :exports both
  (let ((game (parse-map (list "#######"
                               "#.E...#"
                               "#.#..G#"
                               "#.###.#"
                               "#E#G#G#"
                               "#...#G#"
                               "#######"))))
    (run-game game))
#+END_SRC

#+RESULTS: tc-28944
#+begin_example
Round #0
#######
#.E...# (E 200 3)
#.#..G# (G 200 3)
#.###.#
#E#G#G# (G 200 3) (G 200 3) (E 200 3)
#...#G# (G 200 3)
#######
Elf HP: 400
# Elves: 2
Goblin HP: 800
# Goblins: 4
Round #54
#######
#.....#
#.#G..# (G 200 3)
#.###.#
#.#.#.#
#G.G#G# (G 200 3) (G 38 3) (G 98 3)
#######
Elf HP: 0
# Elves: 0
Goblin HP: 536
# Goblins: 4
#+end_example

#+NAME: tc-27755
#+BEGIN_SRC lisp :results output :exports both
  (let ((game (parse-map (list
                          "#######"
                          "#E.G#.#"
                          "#.#G..#"
                          "#G.#.G#"
                          "#G..#.#"
                          "#...E.#"
                          "#######"))))
    (run-game game))
#+END_SRC

#+RESULTS: tc-27755
#+begin_example
Round #0
#######
#E.G#.# (G 200 3) (E 200 3)
#.#G..# (G 200 3)
#G.#.G# (G 200 3) (G 200 3)
#G..#.# (G 200 3)
#...E.# (E 200 3)
#######
Elf HP: 400
# Elves: 2
Goblin HP: 1000
# Goblins: 5
Round #35
#######
#G.G#.# (G 98 3) (G 200 3)
#.#G..# (G 200 3)
#..#..#
#...#G# (G 95 3)
#...G.# (G 200 3)
#######
Elf HP: 0
# Elves: 0
Goblin HP: 793
# Goblins: 5
#+end_example

#+NAME: complex-movement-example
#+BEGIN_SRC lisp :results output :exports both
  (let ((game (parse-map (list "#########"
                               "#G..G..G#"
                               "#.......#"
                               "#.......#"
                               "#G..E..G#"
                               "#.......#"
                               "#.......#"
                               "#G..G..G#"
                               "#########"))))
    (iter (repeat 3)
          (print-grid game)
          (execute-round game))
    (print-grid game))
#+END_SRC

#+RESULTS: complex-movement-example
#+begin_example
Round #0
#########
#G..G..G# (G 200 3) (G 200 3) (G 200 3)
#.......#
#.......#
#G..E..G# (G 200 3) (E 200 3) (G 200 3)
#.......#
#.......#
#G..G..G# (G 200 3) (G 200 3) (G 200 3)
#########
Elf HP: 200
# Elves: 1
Goblin HP: 1600
# Goblins: 8
Round #1
#########
#.G...G.# (G 200 3) (G 200 3)
#...G...# (G 197 3)
#...E..G# (G 200 3) (E 200 3)
#.G.....# (G 200 3)
#.......#
#G..G..G# (G 200 3) (G 200 3) (G 200 3)
#.......#
#########
Elf HP: 200
# Elves: 1
Goblin HP: 1597
# Goblins: 8
Round #2
#########
#..G.G..# (G 200 3) (G 200 3)
#...G...# (G 194 3)
#.G.E.G.# (G 200 3) (E 197 3) (G 200 3)
#.......#
#G..G..G# (G 200 3) (G 200 3) (G 200 3)
#.......#
#.......#
#########
Elf HP: 197
# Elves: 1
Goblin HP: 1594
# Goblins: 8
Round #3
#########
#.......#
#..GGG..# (G 200 3) (G 191 3) (G 200 3)
#..GEG..# (G 200 3) (E 185 3) (G 200 3)
#G..G...# (G 200 3) (G 200 3)
#......G# (G 200 3)
#.......#
#.......#
#########
Elf HP: 185
# Elves: 1
Goblin HP: 1591
# Goblins: 8
#+end_example

#+NAME: from-reddit
#+BEGIN_SRC lisp :results output :exports both
  (let ((game (parse-map (list "################################"
                               "#################.....##########"
                               "#################..#.###########"
                               "#################.........######"
                               "##################......########"
                               "#################G.GG###########"
                               "###############...#..###########"
                               "###############......G..########"
                               "############..G.........########"
                               "##########.G.....G......########"
                               "##########......#.........#..###"
                               "##########...................###"
                               "#########G..G.#####....E.G.E..##"
                               "######..G....#######...........#"
                               "#######.....#########.........##"
                               "#######..#..#########.....#.####"
                               "##########..#########..G.##..###"
                               "###########G#########...E...E.##"
                               "#########.G.#########..........#"
                               "#########GG..#######.......##.E#"
                               "######.G......#####...##########"
                               "#...##..G..............#########"
                               "#...#...........###..E.#########"
                               "#.G.............###...##########"
                               "#................###############"
                               "##.........E.....###############"
                               "###.#..............#############"
                               "###..G........E.....############"
                               "###......E..........############"
                               "###......#....#E#...############"
                               "###....####.#...##.#############"
                               "################################"))))
    (run-game game))
#+END_SRC

The consensus seems to be that this one should be 68 rounds and 2812
health.

#+RESULTS: from-reddit
#+begin_example
Round #0
################################
#################.....##########
#################..#.###########
#################.........######
##################......########
#################G.GG########### (G 200 3) (G 200 3) (G 200 3)
###############...#..###########
###############......G..######## (G 200 3)
############..G.........######## (G 200 3)
##########.G.....G......######## (G 200 3) (G 200 3)
##########......#.........#..###
##########...................###
#########G..G.#####....E.G.E..## (E 200 3) (G 200 3) (E 200 3) (G 200 3) (G 200 3)
######..G....#######...........# (G 200 3)
#######.....#########.........##
#######..#..#########.....#.####
##########..#########..G.##..### (G 200 3)
###########G#########...E...E.## (E 200 3) (E 200 3) (G 200 3)
#########.G.#########..........# (G 200 3)
#########GG..#######.......##.E# (E 200 3) (G 200 3) (G 200 3)
######.G......#####...########## (G 200 3)
#...##..G..............######### (G 200 3)
#...#...........###..E.######### (E 200 3)
#.G.............###...########## (G 200 3)
#................###############
##.........E.....############### (E 200 3)
###.#..............#############
###..G........E.....############ (E 200 3) (G 200 3)
###......E..........############ (E 200 3)
###......#....#E#...############ (E 200 3)
###....####.#...##.#############
################################
Elf HP: 2000
# Elves: 10
Goblin HP: 4000
# Goblins: 20
Round #68
################################
#################.....##########
#################..#.###########
#################.........######
##################......########
#################....###########
###############...#..###########
###############.........########
############............########
##########..............########
##########......#.......G.#..### (G 200 3)
##########...................###
#########.....#####......G....## (G 200 3)
######.......#######....G.G....# (G 119 3) (G 23 3)
#######....G#########...GG....## (G 200 3) (G 188 3) (G 119 3)
#######..#..#########.G.G.#.#### (G 200 3) (G 44 3)
##########..#########..G.##..### (G 200 3)
###########.#########.........##
#########...#########..........#
#########..G.#######.G.....##..# (G 200 3) (G 200 3)
######...GG.G.#####...########## (G 200 3) (G 200 3) (G 200 3)
#...##.G...............######### (G 119 3)
#...#....G......###....######### (G 200 3)
#...............###...##########
#................###############
##...............###############
###.#..............#############
###.................############
###.................############
###......#....#.#...############
###....####.#...##.#############
################################
Elf HP: 0
# Elves: 0
Goblin HP: 2812
# Goblins: 17
#+end_example


#+NAME: test-cases
#+BEGIN_SRC lisp :results output :exports both
  (def-suite aoc.2018.15)
  (in-suite aoc.2018.15)

  (test reading-order
    (is (equal `((#C(0 0) 4) (#C(1 1) 3))
               (reading-order '((#C(1 1) 3) (#C(0 0) 4)) :key #'car))))

  (run! 'aoc.2018.15)
#+END_SRC
